doc/slides/slide_struct_class.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Structure &amp; Classes</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Structure &amp; Classes</h1><hr/>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Notion de classe</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ul class="org-ul">
<li>Langage objet : analyse du problème en termes <b>de nature et de structure des
données</b> &ne; programmation impérative (en C ou fortran) qui relève plus de
l&rsquo;aglorithmie</li>

<li>Une classe est

<ol class="org-ol">
<li><b>une généralisation de la notion de type (<code>int</code>, <code>double</code>,&#x2026;)</b></li>

<li><b>une association de données membres et d'opérations s'y rapportant
(méthodes ou fonctions membres)</b></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Déclaration de classe</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li><p>
Classe <b>&rarr; généralisation de la notion de type</b> (<code>int</code>, <code>double</code>,&#x2026;)
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de donn&#233;es membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
  ...
};
</pre>
</div></li>
</ul>

<div class="CBOX">
<p>
\ding{42} Ne pas oublier le point virgule à la fin de la déclaration
</p>

</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Déclaration de classe</h2>
<div class="outline-text-2" id="text-orgheadline3">
<ul class="org-ul">
<li><p>
Classe <b>&rarr; généralisation de la notion de type</b> (<code>int</code>, <code>double</code>,&#x2026;)
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de donn&#233;es membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
  ...
};
...
<span class="org-comment-delimiter">// </span><span class="org-comment">Instanciation d'objets de type particule</span>
particule my_electron, my_proton;
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">Accès aux membres de la classe en C++</h2>
<div class="outline-text-2" id="text-orgheadline4">
<ul class="org-ul">
<li><p>
Classe <b>&rarr; association de données membres et de méthodes (fonctions
membres)</b>
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de donn&#233;es membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration des m&#233;thodes</span>
  <span class="org-type">void</span> <span class="org-function-name">initialise</span>(<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>);
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
};
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Définition de méthodes de classes</h2>
<div class="outline-text-2" id="text-orgheadline5">
<ul class="org-ul">
<li><p>
Identique à la définition d&rsquo;une fonction mais préfixée du nom de la classe et
de l&rsquo;opérateur de portée <code>::</code>
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de donn&#233;es membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration des m&#233;thodes</span>
  <span class="org-type">void</span> <span class="org-function-name">initialise</span>(<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>);
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
};

<span class="org-type">void</span> <span class="org-constant">particule</span>::<span class="org-function-name">initialise</span>(<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>)
{
  m_masse  = masse_;
  m_charge = charge_;
}
...
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Exemple d&rsquo;utilisation de la classe <code>particule</code></h2>
<div class="outline-text-2" id="text-orgheadline6">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"particule.h"</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Instanciation d'objets de type particule</span>
  <span class="org-type">particule</span> <span class="org-variable-name">my_electron</span>, <span class="org-variable-name">my_proton</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">Acc&#232;s aux donn&#233;es membres</span>
  my_electron.initialise(0.511, -1.6e-19);
  my_proton.initialise(938.0, +1.6e-19);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">Exemple d&rsquo;utilisation de la classe <code>particule</code></h2>
<div class="outline-text-2" id="text-orgheadline7">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"particule.h"</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Instanciation d'objets de type particule</span>
  <span class="org-type">particule</span> * <span class="org-variable-name">ptr_electron</span> = <span class="org-keyword">new</span> <span class="org-type">particule</span>;
  <span class="org-type">particule</span> * <span class="org-variable-name">ptr_proton</span> = <span class="org-keyword">new</span> <span class="org-type">particule</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">Acc&#232;s aux donn&#233;es membres</span>
  ptr_electron-&gt;initialise(0.511, -1.6e-19);
  ptr_proton-&gt;initialise(938.0, +1.6e-19);

  ...
  <span class="org-keyword">delete</span> ptr_electron;
  <span class="org-keyword">delete</span> ptr_proton;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">Annexes</h2>
<div class="outline-text-2" id="text-orgheadline8">
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9">Accès aux membres d&rsquo;une structure</h2>
<div class="outline-text-2" id="text-orgheadline9">
<ul class="org-ul">
<li><p>
L&rsquo;accès aux membres se fait par l&rsquo;intermédiaire de l&rsquo;opérateur point <code>.</code>
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">struct</span> <span class="org-type">particule</span>
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de donn&#233;es membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
  ...
};

<span class="org-comment-delimiter">// </span><span class="org-comment">Instanciation d'objet de type particule</span>
<span class="org-type">particule</span> <span class="org-variable-name">my_electron</span>, <span class="org-variable-name">my_proton</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Acc&#232;s aux donn&#233;es membres</span>
my_electron.m_masse  = 0.511;
my_proton.m_charge = -1.6e-19;
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</body>
</html>
